# 01 Importing Libraries

In [5]:
import pandas as pd
import numpy as np
import os

# 02 Importing Dataframes

In [6]:
path = r'/Users/a/Desktop'

In [7]:
path

'/Users/a/Desktop'

In [8]:
df = pd.read_csv(os.path.join(path, 'city_temperature.csv'), index_col = False)

/Users/a/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [9]:
df.head()

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [10]:
df.columns

Index(['Region', 'Country', 'State', 'City', 'Month', 'Day', 'Year',
       'AvgTemperature'],
      dtype='object')

In [11]:
df.shape

(2906327, 8)

# 03 Mixed Type Data

In [12]:
# Check for mixed data types

for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

State

In [13]:
df['State'] = df['State'].astype('str')

# 04 Finding and Addressing Missing Values

In [14]:
# Finding missing values
df.isnull().sum()

Region            0
Country           0
State             0
City              0
Month             0
Day               0
Year              0
AvgTemperature    0
dtype: int64

# 04 Finding and Addressing Duplicated Values

In [15]:
# Finding Duplicates
df_dups = df[df.duplicated()]

In [161]:
df_dups

        Region  Country State     City  Month  Day  Year  AvgTemperature
745312  Europe  Germany   nan  Hamburg     12    3   201           -99.0
745313  Europe  Germany   nan  Hamburg     12    4   201           -99.0
745314  Europe  Germany   nan  Hamburg     12    5   201           -99.0
745315  Europe  Germany   nan  Hamburg     12    6   201           -99.0
745316  Europe  Germany   nan  Hamburg     12    7   201           -99.0
...        ...      ...   ...      ...    ...  ...   ...             ...
755230  Europe  Germany   nan   Munich     12   27   201           -99.0
755231  Europe  Germany   nan   Munich     12   28   201           -99.0
755232  Europe  Germany   nan   Munich     12   29   201           -99.0
755233  Europe  Germany   nan   Munich     12   30   201           -99.0
755234  Europe  Germany   nan   Munich     12   31   201           -99.0

[390 rows x 8 columns]

In [16]:
#deleting duplicates
df.drop_duplicates()

,Region,Country,State,City,Month,Day,Year,AvgTemperature
0,Africa,Algeria,nan,Algiers,1,1,1995,64.2
1,Africa,Algeria,nan,Algiers,1,2,1995,49.4
2,Africa,Algeria,nan,Algiers,1,3,1995,48.8
3,Africa,Algeria,nan,Algiers,1,4,1995,46.4
4,Africa,Algeria,nan,Algiers,1,5,1995,47.9
...,...,...,...,...,...,...,...,...
2906322,North America,US,Additional Territories,San Juan Puerto Rico,7,27,2013,82.4
2906323,North America,US,Additional Territories,San Juan Puerto Rico,7,28,2013,81.6
2906324,North America,US,Additional Territories,San Juan Puerto Rico,7,29,2013,84.2
2906325,North America,US,Additional Territories,San Juan Puerto Rico,7,30,2013,83.8
2906326,North America,US,Additional Territories,San Juan Puerto Rico,7,31,2013,83.6

In [17]:
#dropping columns
df = df.drop(columns = ['State'])

# 05 Descriptive Analysis

In [18]:
df.describe()

              Month           Day          Year  AvgTemperature
count  2.906327e+06  2.906327e+06  2.906327e+06    2.906327e+06
mean   6.469163e+00  1.571682e+01  2.006624e+03    5.600492e+01
std    3.456489e+00  8.800534e+00  2.338226e+01    3.212359e+01
min    1.000000e+00  0.000000e+00  2.000000e+02   -9.900000e+01
25%    3.000000e+00  8.000000e+00  2.001000e+03    4.580000e+01
50%    6.000000e+00  1.600000e+01  2.007000e+03    6.250000e+01
75%    9.000000e+00  2.300000e+01  2.013000e+03    7.550000e+01
max    1.200000e+01  3.100000e+01  2.020000e+03    1.100000e+02

# 06 Exporting Data

In [19]:
path = r'/Users/a/Career Foundry/Achievement 6/02 Data/02 Prepared Data'

In [20]:
path

'/Users/a/Career Foundry/Achievement 6/02 Data/02 Prepared Data'

In [21]:
df.to_csv(os.path.join(path,'df_cleaned.csv'))